cfg/Client/Catalogs/Достижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Достижения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМанулов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Client/CommonForms/ФормаПодсчётаМанулов/Ext/Form/Module.bsl
&НаКлиенте
Процедура Считать(Команда)
	КоличествоМанулов = КоличествоМанулов + 1;
КонецПроцедуры

&НаСервере
Процедура СохранитьДостиженияНаСервере()
	НовоеДостижение = Справочники.Достижения.СоздатьЭлемент();
НовоеДостижение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
НовоеДостижение.КоличествоМанулов = КоличествоМанулов;
НовоеДостижение.Наименование = ПараметрыСеанса.ТекущийПользователь;
НовоеДостижение.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДостижения(Команда)
	СохранитьДостиженияНаСервере();
	
Если ОтправитьДанныеНаСервер() Тогда
Предупреждение("Достижения сохранены и отправлены");
Иначе
Предупреждение("Достижения сохранены, но не отправлены");
КонецЕсли;

Закрыть();
КонецПроцедуры

&НаСервере
Функция ОтправитьДанныеНаСервер()
//Записываем наши данные в структуру для отправки на сервер
СтруктураДанных = Новый Структура;
СтруктураДанных.Вставить("Наименование",
ПараметрыСеанса.ТекущийПользователь);
СтруктураДанных.Вставить("Пользователь",
ПараметрыСеанса.ТекущийПользователь);
СтруктураДанных.Вставить("КоличествоМанулов", КоличествоМанулов);
//Создаем новую переменную для записи информации в JSON
ЗаписьJSON = Новый ЗаписьJSON;
ЗаписьJSON.УстановитьСтроку();
//Записываем нашу структуру в JSON
ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
//Получаем закодированные данные строкой
ДанныеСтрокой = ЗаписьJSON.Закрыть();
//Добавляем попытку отправки данных на сервер
Попытка
//Подключаемся к нашему серверу
//Тут указываем IP нашего компьютера
//Для примера указывается 127.0.0.1
HTTPСоединение = Новый HTTPСоединение("127.0.0.1");
//Пишем запрос для отправки данных
//Указываем тут наш сервер Exchange и его метод
//Также передаем наши данные строкой в виде параметра ?SendAchievements=""
HTTPЗапрос = Новый HTTPЗапрос("Exchange/hs/Exchange?SendAchievements=" + ДанныеСтрокой);
//Отправляем наши данные на сервер и получаем ответ
Ответ = HTTPСоединение.Получить(HTTPЗапрос);
//Раз мы дошли до этого места, значит, система отправила данные
//Поэтому возвращаем истину
Возврат Истина; Исключение
КонецПопытки;
//Если данные не удалось отправить, возвращаем ложь 
Возврат Ложь;
КонецФункции
